Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 2048, 13)]   0           []                               
                                                                                                  
 sequential (Sequential)        (None, 2048, 1)      337         ['input_1[0][0]']                
                                                                                                  
 sequential_1 (Sequential)      (None, 2048, 1)      337         ['input_1[0][0]']                
                                                                                                  
 input_2 (InputLayer)           [(None, 1, 2)]       0           []                               
                                                                                                  
 input_3 (InputLayer)           [(None, 2048, 2)]    0           []                               
                                                                                                  
 concatenate (Concatenate)      (None, 2048, 2)      0           ['sequential[0][0]',             
                                                                  'sequential_1[0][0]']           
                                                                                                  
 tf.compat.v1.shape (TFOpLambda  (3,)                0           ['concatenate[0][0]']            
 )                                                                                                
                                                                                                  
 tf.__operators__.getitem_2 (Sl  ()                  0           ['tf.compat.v1.shape[0][0]']     
 icingOpLambda)                                                                                   
                                                                                                  
 tf.cast (TFOpLambda)           ()                   0           ['tf.__operators__.getitem_2[0][0
                                                                 ]']                              
                                                                                                  
 tf.math.reduce_sum (TFOpLambda  (None, 1, 2)        0           ['input_3[0][0]']                
 )                                                                                                
                                                                                                  
 tf.math.multiply (TFOpLambda)  (None, 2048, 2)      0           ['concatenate[0][0]',            
                                                                  'input_3[0][0]']                
                                                                                                  
 tf.math.truediv (TFOpLambda)   (None, 1, 2)         0           ['tf.cast[0][0]',                
                                                                  'tf.math.reduce_sum[0][0]']     
                                                                                                  
 tf.math.reduce_mean (TFOpLambd  (None, 1, 2)        0           ['tf.math.multiply[0][0]']       
 a)                                                                                               
                                                                                                  
 tf.math.multiply_1 (TFOpLambda  (None, 1, 2)        0           ['tf.math.truediv[0][0]',        
 )                                                                'tf.math.reduce_mean[0][0]']    
                                                                                                  
 tf.math.subtract (TFOpLambda)  (None, 1, 2)         0           ['tf.math.multiply_1[0][0]',     
                                                                  'input_2[0][0]']                
                                                                                                  
 tf.math.square (TFOpLambda)    (None, 1, 2)         0           ['tf.math.subtract[0][0]']       
                                                                                                  
 tf.math.reduce_mean_1 (TFOpLam  ()                  0           ['tf.math.square[0][0]']         
 bda)                                                                                             
                                                                                                  
 add_loss (AddLoss)             ()                   0           ['tf.math.reduce_mean_1[0][0]']  
                                                                                                  
==================================================================================================
Total params: 674
Trainable params: 674
Non-trainable params: 0
__________________________________________________________________________________________________
