Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 100, 13)]    0           []                               
                                                                                                  
 input_2 (InputLayer)           [(None, None, 1)]    0           []                               
                                                                                                  
 input_3 (InputLayer)           [(None, 100, 1)]     0           []                               
                                                                                                  
 sequential (Sequential)        (None, 100, 1)       261         ['input_1[0][0]']                
                                                                                                  
 tf.compat.v1.shape (TFOpLambda  (3,)                0           ['sequential[0][0]']             
 )                                                                                                
                                                                                                  
 tf.compat.v1.shape_1 (TFOpLamb  (3,)                0           ['sequential[0][0]']             
 da)                                                                                              
                                                                                                  
 tf.__operators__.getitem_2 (Sl  ()                  0           ['tf.compat.v1.shape[0][0]']     
 icingOpLambda)                                                                                   
                                                                                                  
 tf.__operators__.getitem_3 (Sl  ()                  0           ['tf.compat.v1.shape_1[0][0]']   
 icingOpLambda)                                                                                   
                                                                                                  
 tf.math.multiply (TFOpLambda)  ()                   0           ['tf.__operators__.getitem_2[0][0
                                                                 ]',                              
                                                                  'tf.__operators__.getitem_3[0][0
                                                                 ]']                              
                                                                                                  
 tf.math.subtract (TFOpLambda)  (None, 100, 1)       0           ['sequential[0][0]',             
                                                                  'input_2[0][0]']                
                                                                                                  
 tf.cast (TFOpLambda)           ()                   0           ['tf.math.multiply[0][0]']       
                                                                                                  
 tf.math.reduce_sum (TFOpLambda  ()                  0           ['input_3[0][0]']                
 )                                                                                                
                                                                                                  
 tf.math.multiply_1 (TFOpLambda  (None, 100, 1)      0           ['input_3[0][0]',                
 )                                                                'tf.math.subtract[0][0]']       
                                                                                                  
 tf.math.truediv (TFOpLambda)   ()                   0           ['tf.cast[0][0]',                
                                                                  'tf.math.reduce_sum[0][0]']     
                                                                                                  
 tf.math.square (TFOpLambda)    (None, 100, 1)       0           ['tf.math.multiply_1[0][0]']     
                                                                                                  
 tf.math.multiply_2 (TFOpLambda  (None, 100, 1)      0           ['tf.math.truediv[0][0]',        
 )                                                                'tf.math.square[0][0]']         
                                                                                                  
 tf.math.reduce_mean (TFOpLambd  ()                  0           ['tf.math.multiply_2[0][0]']     
 a)                                                                                               
                                                                                                  
 add_loss (AddLoss)             ()                   0           ['tf.math.reduce_mean[0][0]']    
                                                                                                  
==================================================================================================
Total params: 261
Trainable params: 261
Non-trainable params: 0
__________________________________________________________________________________________________
